Revit 2026 API

# DirectShapeTypeOptions Methods

---

The DirectShapeTypeOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqualTo | Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same. |
|  | IsValid | Determines whether a DirectShapeTypeOptions is internally consistent (valid). |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DirectShapeTypeOptions Class

Autodesk.Revit.DB Namespace